In [35]:
# Imports
import pandas as pd
import numpy as np

In [36]:
df = pd.read_csv("bad_table.csv")
df.head()

            Name Geschlecht  Gehalt
0  Jakob Mueller   männlich      40
1     Anna Bauer   weiblich      27
2  Richard Stein       Mann      45
3    Jana Brecht       Frau      50

In [37]:
# Cleaning agenda:
    # Names should be two separate columns
    # Gender (Geschlecht) should be either m for male or w for female
    # Income should be 40.000, not 40 etc. (error with delimiter)

In [38]:
# Checking types
df.dtypes

Name          object
Geschlecht    object
Gehalt         int64
dtype: object

# Splitting the name column

In [39]:
# new df with split value columns
new = df["Name"].str.split(" ", n = 1, expand = True)

# making seperate first name column from new df
df["First Name"]= new[0]

# making seperate last name column from new data frame 
df["Last Name"]= new[1]

# Dropping old Name columns 
df.drop(columns =["Name"], inplace = True) 

# df display 
df.head()

  Geschlecht  Gehalt First Name Last Name
0   männlich      40      Jakob   Mueller
1   weiblich      27       Anna     Bauer
2       Mann      45    Richard     Stein
3       Frau      50       Jana    Brecht

# Converting gender strings to single letters

In [40]:
df["Geschlecht"].unique()

array(['männlich', 'weiblich', 'Mann', 'Frau'], dtype=object)

In [41]:
df["Geschlecht"] = df["Geschlecht"].replace({'männlich': 'm',
                                             'weiblich': 'w',
                                             'Mann': 'm',
                                             'Frau': 'w'})

In [42]:
df.head()

  Geschlecht  Gehalt First Name Last Name
0          m      40      Jakob   Mueller
1          w      27       Anna     Bauer
2          m      45    Richard     Stein
3          w      50       Jana    Brecht

# Fixing income column

In [43]:
df['Gehalt'] = df['Gehalt'] * 1000
df.head()

  Geschlecht  Gehalt First Name Last Name
0          m   40000      Jakob   Mueller
1          w   27000       Anna     Bauer
2          m   45000    Richard     Stein
3          w   50000       Jana    Brecht

# Resorting columns

In [45]:
df = pd.DataFrame([df["First Name"], df["Last Name"],
                   df["Geschlecht"], df["Gehalt"]]).transpose()

df.head()

  First Name Last Name Geschlecht Gehalt
0      Jakob   Mueller          m  40000
1       Anna     Bauer          w  27000
2    Richard     Stein          m  45000
3       Jana    Brecht          w  50000